tutorials/solverStudy/ibm_simpleFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pisoFoam;
cfdFunctions    (flow);

libs
(
    // "dynamicLoadBalanceFvMesh"
    "soIBM"
    "libVoF"
);

geometry        naca0006;

startFrom       startTime; //latestTime;

startTime       0;

stopAt          endTime;

endTime         10000;

deltaT          1;

writeControl    adjustableRunTime;

writeInterval   1000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

//maxCo           0.5;

functions
{
    #include "CVforces"
    //#include "fieldAverage"
    //#include "codedFunctions"
}


// ************************************************************************* //
